/* 🔁 تغيير المشاهد */
function show(id){
document.querySelectorAll(".scene").forEach(s=>s.classList.remove("active"));
document.getElementById(id).classList.add("active");
}

/* 🎁 */
function openGift(){
show("login");
}

/* 🔐 */
function check(){
if(pass.value==="سجوو"){
show("cake");
}else{
alert("جربي التلميح 🤍");
}
}

/* 🎂 شمعة + سكين */
let clicks=0;
let lit=false;

candle.onclick=()=>{

if(!lit){
clicks++;
if(clicks>=4){
candle.innerText="🕯️🔥";
hint.innerText="اضغطي السكين";
lit=true;
}
}else{
knife.style.display="block";
cake.style.transform="scale(0)";
setTimeout(()=>show("story"),1000);
}
};

/* 📰 القصة كاملة دفعة واحدة (بدون تقسيم) */
let story = `من يوم 3 / 12  
وانا بديت نحس بشي مختلف...

مش فاهمه في البداية  
ولا حتى عارف شنو هو بالضبط  

بس مع الأيام  
لقيت روحي نميل لك  
ونرتاح لك  

اني الفتره اللي فاتت كلها  
ومنيش مستريح  
حاس في شي ناقص...  

وكل مرة نقول  
شنو الشي هذا؟  

بس أول ما نهدرز معاك  
نحس كأني لقيته  

حتى لو ما قلتي شي  
وجودك بس...  
يرتاحله قلبي  

كأنك خديتي بيدي  
وطبطبتي عليا  

واني رغم اني نشوف الحكي ضعف  
لكن معاك لا  

معاك نحكي بدون خوف  

حتى لما نقولك مستاحشك  
مش كلمة وخلاص  

هذي شعور  

لأني نبي نهدرز معاك ديما  
مش لأن مفيش شي نديره  

لكن لأنك انتي  
الاستراحة متعي  

من كل دوشة في راسي  

مرات نحاول نهرب  
نرقد... نطلع... نضيع وقت  

بس في النهاية  
نرجع نفكر فيك  

ونلقى روحي نبي نهدرز معاك  
حتى لو دقيقة  

ويمكن مرات نحس روحي ثقيل  
لكن الحقيقة نبيك انتي 🤍  

جوجو 🤍  
كل عام وانتي بخير يا قطعة من قلبي…  
انتي مش يوم… انتي حياة كاملة  

سجى❤️‍🩹  
لو نقعد نحكي من توّا لغدوا  
ما نوصلش للي في قلبي عليك  

انتي ملاذي الآمن  
المكان اللي نلقى فيه راحتي بدون تفسير  

انتي الشمعة اللي نورت ظلامي  
والنور اللي نمشي عليه في طريقي  

وجودك جنبي يكفيني  
وكلامك يبدل يومي  

حتى سكوتك مرات  
فيه راحة ما نلقاهاش في أي حد  

أنا عارفك كويس  
وعارف إنك مش من النوع اللي يقول كلام حلو  

بس كل تصرف منك  
يوصلني أكثر من ألف كلمة  

نشوفك في خوفك عليا  
في سؤالك  
في التفاصيل الصغيرة  

سجوووو ❣️  
أنا نحبك حب ثابت وصادق  

حب خلاني نشوف فيك حياة  
مش مجرد علاقة  

ويمكن توّا مش جاهز لكل شي  
لكن قاعد نحاول نبني نفسي  

مش بس علشاني  
لكن علشانك انتي 🤍  

نبي نكون راجل يليق بيك  
ونعوضك على كل لحظة تعب  

نبيك تكوني حلالي  
مش مجرد ذكرى وتمشي  

نبيك في كل خطوة  
في كل بداية ونهاية  

نبي نشاركك حياتي  
نفرح معاك  
ونوقف معاك  

ونكون لك الأمان  
زي ما كنتي ليا أمان  

كل عام وانتي معاي  
وكل دعوة مني ليك  
إن ربي يجمعني بيك بالحلال 🤍`;

/* 💌 عرض النص دفعة واحدة */
let shown=false;

setTimeout(()=>{
storyText.innerText = story;
readBtn.style.display="block";
shown=true;
},1200);

/* ✔ لما تضغط قرأت */
function finishStory(){
if(!shown) return;
show("end");
}
